shopping_items = [
    ['맥스틸 TRON G10PRO', 22890, '상품평 2,464', '등록일 2018.08.'],
    ['로지텍G G102', 19820, '상품평 15,337', '등록일 2016.10.'],
    ['몬스타기어 데빌스킬', 35000, '상품평 1,200', '등록일 2018.05.'],
    ['맥스틸 TRON G10', 19800, '상품평 16,788', '등록일 2014.11.'],
    ['로지텍 B100', 10690, '상품평 4,016', '등록일 2017.01.'],
    ['앱코 WM300', 5490, '상품평 826', '등록일 2018.05.'],
    ['앱코 HACKER A660', 29790, '상품평 1,834', '등록일 2017.08.'],
    ['HP M100', 4390, '상품평 3,852', '등록일 2017.09.'],
    ['로지텍 G G402', 35300, '상품평 4,005', '등록일 2014.09.'],
    ['제닉스 M1', 11880, '상품평 7,222', '등록일 2013.05.']
    ]

totalprice = 0
for item in shopping_items:
    totalprice += item[1]
    print(item[0],'제품은',item[-1][6:8],'년',item[-1][9:11],'월에 등록되었습니다.')
print(totalprice/len(shopping_items))